In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(
    columns=["Name", "Age", "Height"],
)

In [4]:
df

Empty DataFrame
Columns: [Name, Age, Height]
Index: []

In [5]:
df.loc[0] = ["Allen", 25, 175]

In [6]:
df

    Name  Age  Height
0  Allen   25     175

In [7]:
df.loc[1] = ["Bob", 30, 180]
df.loc[2] = ["Cathy", 28, 165]

In [8]:
df

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180
2  Cathy   28     165

In [9]:
df["Weight"] = [70, 80, 60]

In [10]:
df

    Name  Age  Height  Weight
0  Allen   25     175      70
1    Bob   30     180      80
2  Cathy   28     165      60

In [11]:
df.drop("Weight", axis=1)

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180
2  Cathy   28     165

In [12]:
df

    Name  Age  Height  Weight
0  Allen   25     175      70
1    Bob   30     180      80
2  Cathy   28     165      60

In [13]:
df = df.drop("Weight", axis=1)
df

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180
2  Cathy   28     165

In [14]:
df.drop(2)

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180

In [15]:
df

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180
2  Cathy   28     165

In [16]:
df = df.drop(2)

In [17]:
df

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180

In [18]:
df["Height"][0]

np.int64(175)

In [19]:
df["Height"][0] = 178

/var/folders/_k/k5dry95j0q5d35_9pn5d86vm0000gn/T/ipykernel_10678/1784337542.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df["Height"][0] = 178
/var/folders/_k/k5dry95j0q5d35_9pn5d86vm0000gn/T/ipykernel_10678/1784337542.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["Height"][0] = 178

In [20]:
df

    Name  Age  Height
0  Allen   25     178
1    Bob   30     180

In [21]:
df.loc[0, "Height"]

np.int64(178)

In [22]:
df.loc[0, "Height"] = 179

In [23]:
df

    Name  Age  Height
0  Allen   25     179
1    Bob   30     180

In [24]:
df.loc[0:1, "Age":"Height"]

   Age  Height
0   25     179
1   30     180

In [25]:
df

    Name  Age  Height
0  Allen   25     179
1    Bob   30     180

In [26]:
"""
select
    Name
    , Age
    , Height
from df2
"""
data = [
    ["Allen", 25, 175],
    ["Bob", 30, 180],
    ["Cathy", 28, 165],
]
columns = ["Name", "Age", "Height"]
df2 = pd.DataFrame(data, columns=columns)

In [27]:
df2

    Name  Age  Height
0  Allen   25     175
1    Bob   30     180
2  Cathy   28     165

In [28]:
"""
select * from df
union all
select * from df2
"""
pd.concat(
    [df, df2],
    ignore_index=True,
)

    Name  Age  Height
0  Allen   25     179
1    Bob   30     180
2  Allen   25     175
3    Bob   30     180
4  Cathy   28     165

In [29]:
df["Age"]

0    25
1    30
Name: Age, dtype: int64

In [30]:
df

    Name  Age  Height
0  Allen   25     179
1    Bob   30     180

In [31]:
df.to_json(
    "df.json",
)

In [33]:
df.to_json(
    "df_columns.json",
    orient="columns",
    indent=4,
)

In [34]:
df.to_json(
    "df_records.json",
    orient="records",
    indent=4,
)

In [ ]:
df.to_json(
    "df_records.jsonl",
    orient="records",
    lines=True,
)

In [36]:
df.to_json(
    "df_index.json",
    orient="index",
    indent=4,
)

In [37]:
df.to_json(
    "df_split.json",
    orient="split",
    indent=4,
)

In [38]:
df.to_json(
    "df_table.json",
    orient="table",
    indent=4,
)

In [40]:
df_with_col = pd.read_csv(
    "ptt.csv",
)

df_with_col

,推,噓,分數,作者,標題,時間
0,推: 25,噓: 4,分數: 21,作者: Rusnake5566 (魯蛇+56 PTT最強帳號),標題: [問卦] 兩個候選人選前一個月同時陣亡的可能性,時間: Fri Oct 2 13:56:39 2020
1,推: 11,噓: 11,分數: 0,作者: LoveMakeLove (ボケ),標題: [新聞]江啟臣：兩岸是不對稱的戰爭 從募兵改徵兵,時間: Wed Oct 7 18:53:08 2020
2,推: 20,噓: 0,分數: 20,作者: MintSu (Simon),標題: [問卦] 如果川普老婆死於武漢肺炎會怎麼樣？,時間: Fri Oct 2 13:30:55 2020
3,推: 31,噓: 2,分數: 29,作者: seiya2000 (風見),標題: [問卦] 為什麼古代生物體型可以長到這麼大？,時間: Fri Oct 2 12:35:18 2020
4,推: 106,噓: 6,分數: 100,作者: kasumi5566 (霞),標題: [問卦] 支那女生是不是都沒錢修補衣服,時間: Fri Oct 2 13:43:25 2020
...,...,...,...,...,...,...
833,推: 10,噓: 1,分數: 9,作者: lockgolden (鎖金),標題: [問卦] PTT十年後會像無名小站那樣關閉嗎?,時間: Fri Oct 2 14:09:32 2020
834,推: 7,噓: 0,分數: 7,作者: nothisman (在人海中迷失),標題: [新聞] 地表「最胖肥熊」出爐！ 635kg棕熊挺「,時間: Wed Oct 7 21:00:58 2020
835,推: 0,噓: 0,分數: 0,作者: wa778895 (oilsunbright),標題: [問卦] 我是被下套了嗎？,時間: Wed Oct 7 21:27:26 2020
836,推: 15,噓: 4,分數: 11,作者: stan0720 (Kimo),標題: [問卦] 認真問 人一天可以走幾公里呀？,時間: Fri Oct 2 14:00:50 2020
837,推: 5,噓: 0,分數: 5,作者: bigtreelife (Tree),標題: [問卦] 叫外送的年輕人都是什麼人,時間: Fri Oct 2 15:29:44 2020

In [45]:
df_no_col = pd.read_csv(
    "ptt_no_col.csv",
    header=None,
    names=["推", "噓", "分數", "作者", "標題", "時間"],
)

df_no_col

,推,噓,分數,作者,標題,時間
0,推: 25,噓: 4,分數: 21,作者: Rusnake5566 (魯蛇+56 PTT最強帳號),標題: [問卦] 兩個候選人選前一個月同時陣亡的可能性,時間: Fri Oct 2 13:56:39 2020
1,推: 11,噓: 11,分數: 0,作者: LoveMakeLove (ボケ),標題: [新聞]江啟臣：兩岸是不對稱的戰爭 從募兵改徵兵,時間: Wed Oct 7 18:53:08 2020
2,推: 20,噓: 0,分數: 20,作者: MintSu (Simon),標題: [問卦] 如果川普老婆死於武漢肺炎會怎麼樣？,時間: Fri Oct 2 13:30:55 2020
3,推: 31,噓: 2,分數: 29,作者: seiya2000 (風見),標題: [問卦] 為什麼古代生物體型可以長到這麼大？,時間: Fri Oct 2 12:35:18 2020
4,推: 106,噓: 6,分數: 100,作者: kasumi5566 (霞),標題: [問卦] 支那女生是不是都沒錢修補衣服,時間: Fri Oct 2 13:43:25 2020
...,...,...,...,...,...,...
833,推: 10,噓: 1,分數: 9,作者: lockgolden (鎖金),標題: [問卦] PTT十年後會像無名小站那樣關閉嗎?,時間: Fri Oct 2 14:09:32 2020
834,推: 7,噓: 0,分數: 7,作者: nothisman (在人海中迷失),標題: [新聞] 地表「最胖肥熊」出爐！ 635kg棕熊挺「,時間: Wed Oct 7 21:00:58 2020
835,推: 0,噓: 0,分數: 0,作者: wa778895 (oilsunbright),標題: [問卦] 我是被下套了嗎？,時間: Wed Oct 7 21:27:26 2020
836,推: 15,噓: 4,分數: 11,作者: stan0720 (Kimo),標題: [問卦] 認真問 人一天可以走幾公里呀？,時間: Fri Oct 2 14:00:50 2020
837,推: 5,噓: 0,分數: 5,作者: bigtreelife (Tree),標題: [問卦] 叫外送的年輕人都是什麼人,時間: Fri Oct 2 15:29:44 2020

In [46]:
df_no_col = pd.read_csv(
    "ptt_no_col.csv",
    header=None,
)

df_no_col.columns = ["推", "噓", "分數", "作者", "標題", "時間"]

df_no_col

,推,噓,分數,作者,標題,時間
0,推: 25,噓: 4,分數: 21,作者: Rusnake5566 (魯蛇+56 PTT最強帳號),標題: [問卦] 兩個候選人選前一個月同時陣亡的可能性,時間: Fri Oct 2 13:56:39 2020
1,推: 11,噓: 11,分數: 0,作者: LoveMakeLove (ボケ),標題: [新聞]江啟臣：兩岸是不對稱的戰爭 從募兵改徵兵,時間: Wed Oct 7 18:53:08 2020
2,推: 20,噓: 0,分數: 20,作者: MintSu (Simon),標題: [問卦] 如果川普老婆死於武漢肺炎會怎麼樣？,時間: Fri Oct 2 13:30:55 2020
3,推: 31,噓: 2,分數: 29,作者: seiya2000 (風見),標題: [問卦] 為什麼古代生物體型可以長到這麼大？,時間: Fri Oct 2 12:35:18 2020
4,推: 106,噓: 6,分數: 100,作者: kasumi5566 (霞),標題: [問卦] 支那女生是不是都沒錢修補衣服,時間: Fri Oct 2 13:43:25 2020
...,...,...,...,...,...,...
833,推: 10,噓: 1,分數: 9,作者: lockgolden (鎖金),標題: [問卦] PTT十年後會像無名小站那樣關閉嗎?,時間: Fri Oct 2 14:09:32 2020
834,推: 7,噓: 0,分數: 7,作者: nothisman (在人海中迷失),標題: [新聞] 地表「最胖肥熊」出爐！ 635kg棕熊挺「,時間: Wed Oct 7 21:00:58 2020
835,推: 0,噓: 0,分數: 0,作者: wa778895 (oilsunbright),標題: [問卦] 我是被下套了嗎？,時間: Wed Oct 7 21:27:26 2020
836,推: 15,噓: 4,分數: 11,作者: stan0720 (Kimo),標題: [問卦] 認真問 人一天可以走幾公里呀？,時間: Fri Oct 2 14:00:50 2020
837,推: 5,噓: 0,分數: 5,作者: bigtreelife (Tree),標題: [問卦] 叫外送的年輕人都是什麼人,時間: Fri Oct 2 15:29:44 2020